## Handling Missing values using Pandas and Scikit Learn

In [1]:
# Importing all necessary libraries

import numpy as np
import pandas as pd

In [2]:
# Loading the dataset

df = pd.read_csv('datasets/titanic.csv')

# Copying the dataframe to another 

new_df = df.copy()

In [3]:
# Viewing first few rows of data

df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [4]:
# Get the dimensions of the data

df.shape

(891, 12)

In [5]:
# Summary Statistics of the data

df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
# Number of missing values in the data

df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
# Number of non - null values in the data

df.notnull().sum()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [8]:
# Number of non - null values in the data

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [9]:
# View the datatypes of data in the dataset

df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### Using Pandas

In [10]:
# Deleting rows  

mod_df = df.dropna()

In [11]:
# No of non - null values in the modified data

mod_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 183 entries, 1 to 889
Data columns (total 12 columns):
PassengerId    183 non-null int64
Survived       183 non-null int64
Pclass         183 non-null int64
Name           183 non-null object
Sex            183 non-null object
Age            183 non-null float64
SibSp          183 non-null int64
Parch          183 non-null int64
Ticket         183 non-null object
Fare           183 non-null float64
Cabin          183 non-null object
Embarked       183 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 18.6+ KB

In [13]:
# Set the limit
# Drop columns using that limit

limit = len(df) * 0.7
new=df.dropna(axis=1, thresh=limit)

In [14]:
# View columns in the dataset

new.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [15]:
# Replacing null values with mean, median 

# Number of null values Age column has

df['Age'].isnull().sum()

177

In [16]:
# Mean of Age column

df['Age'].mean()

29.69911764705882

In [17]:
# Median of Age column

df['Age'].median()

28.0

In [18]:
# Mode of Age column

df['Age'].mode()

0    24.0
dtype: float64

In [19]:
# Replace Null Values (np.nan) with mean

df['Age'] = df['Age'].replace(np.nan, df['Age'].mean())

# Alternate way to fill null values with mean

df['Age'] = df['Age'].fillna(df['Age'].mean())

In [20]:
# Checking for null values in Age column

df['Age'].isnull().sum()

0

In [28]:
# In the same way we can impute using median and mode

df['Age'] = df['Age'].replace(np.nan, df['Age'].median())

df['Age'] = df['Age'].replace(np.nan, df['Age'].mode())

In [ ]:
# Alternate ways to impute null values with median and mode

df['Age'] = df['Age'].fillna(df['Age'].median())

df['Age'] = df['Age'].fillna(df['Age'].mode())

In [ ]:
# Backward fill or Forward fill can be used to impute the previous or next values

# Backward fill

df['Age'] = df['Age'].fillna(method='bfill')

# Forward fill

df['Age'] = df['Age'].fillna(method='ffill')

In [21]:
# Handling Missing values in Categorical data

df[['Cabin','Embarked']].head()

  Cabin Embarked
0   NaN        S
1   C85        C
2   NaN        S
3  C123        S
4   NaN        S

In [22]:
# Number of Missing values in both the columns

df[['Cabin', 'Embarked']].isnull().sum()

Cabin       687
Embarked      2
dtype: int64

In [23]:
# Most frequent values in the Embarked column data

df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [24]:
# Replacing the null values with the most frequent value 

df['Embarked'] = df['Embarked'].fillna(df['Embarked'].value_counts().index[0])

In [25]:
# Checking for null values in the Embarked Column

df['Embarked'].isnull().sum()

0

In [26]:
# Value counts for Embarked column

df['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [27]:
# Replacing null values with Unknown Class

df['Cabin'] = df['Cabin'].fillna('Unknown')

In [29]:
# Value counts for Cabin Column

df['Cabin'].value_counts().head()

Unknown        687
B96 B98          4
G6               4
C23 C25 C27      4
F33              3
Name: Cabin, dtype: int64

In [30]:
# Checking for null values in Cabin column

df['Cabin'].isnull().sum()

0

In [31]:
# Dimensions of modified dataset

df.shape

(891, 12)

In [32]:
# No of non - null values in the modified dataset

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          891 non-null object
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

### Using Scikit Learn

In [33]:
# Importing libraries

from sklearn.impute import SimpleImputer # Required for imputing values

In [34]:
# Number of non - null values in the dataset

new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [35]:
# Number of null values in the dataset using MissingIndicator

from sklearn.impute import MissingIndicator
indicator = MissingIndicator(missing_values=np.nan)
indicator = indicator.fit_transform(new_df)
indicator_df = pd.DataFrame(indicator, columns=['Age', 'Cabin', 'Embarked'])

In [36]:
# Number of missing values in these three columns

indicator_df.sum()

Age         177
Cabin       687
Embarked      2
dtype: int64

In [37]:
# Summary statistics of the dataframe

new_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [38]:
# Replacing the null values in the Age column with Mean

from sklearn.impute import SimpleImputer

imputer = SimpleImputer(missing_values=np.nan, strategy='mean')

In [39]:
# Fit and transform to the parameters

new_df['Age'] = imputer.fit_transform(new_df[['Age']])

In [40]:
# Checking for any null values

new_df['Age'].isnull().sum()

0

In [151]:
# Alternatively, we can replace null values with median, most frequent value and also with an constant

# Replace with Median

imputer = SimpleImputer(missing_values=np.nan, strategy='median')

new_df['Age'] = imputer.fit_transform(new_df[['Age']])

In [57]:
# Most frequent value in Cabin data

new_df['Embarked'].value_counts().head(1)

S    644
Name: Embarked, dtype: int64

In [41]:
# Replacing null values in Cabin with most frequent value

imputer = SimpleImputer(missing_values=np.nan, strategy='most_frequent')

new_df['Embarked'] = imputer.fit_transform(new_df[['Embarked']])

In [42]:
# Value counts for Cabin data

new_df['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [43]:
# Checking for null values in the Embarked column

new_df['Embarked'].isnull().sum()

0

In [44]:
# Replacing null values in Cabin with Unknown class

imputer = SimpleImputer(missing_values=np.nan, strategy='constant', fill_value='Unknown')

new_df['Cabin'] = imputer.fit_transform(new_df[['Cabin']])

In [45]:
# Checking for null values in the Cabin column

new_df['Cabin'].isnull().sum()

0

In [46]:
# Value counts for Cabin column

new_df['Cabin'].value_counts().head(5)

Unknown        687
B96 B98          4
G6               4
C23 C25 C27      4
F33              3
Name: Cabin, dtype: int64

In [48]:
# Save to an csv file

df.to_csv('data_titanic.csv')
new_df.to_csv('data_titanic-new.csv')